benchmarks/results_before_tuning.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: benchmarks/peak_fixed.js
        output: -

     scenarios: (100.00%) 1 scenario, 200 max VUs, 1m15s max duration (incl. graceful stop):
              * default: Up to 200 looping VUs for 45s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 020/200 VUs, 6442 complete and 0 interrupted iterations
default   [   2% ] 020/200 VUs  01.0s/45.0s

running (0m02.0s), 040/200 VUs, 15172 complete and 0 interrupted iterations
default   [   4% ] 040/200 VUs  02.0s/45.0s

running (0m03.0s), 060/200 VUs, 24017 complete and 0 interrupted iterations
default   [   7% ] 060/200 VUs  03.0s/45.0s

running (0m04.0s), 079/200 VUs, 34207 complete and 0 interrupted iterations
default   [   9% ] 079/200 VUs  04.0s/45.0s

running (0m05.0s), 099/200 VUs, 44791 complete and 0 interrupted iterations
default   [  11% ] 099/200 VUs  05.0s/45.0s

running (0m06.0s), 119/200 VUs, 55198 complete and 0 interrupted iterations
default   [  13% ] 119/200 VUs  06.0s/45.0s

running (0m07.0s), 140/200 VUs, 66112 complete and 0 interrupted iterations
default   [  16% ] 140/200 VUs  07.0s/45.0s

running (0m08.0s), 159/200 VUs, 76004 complete and 0 interrupted iterations
default   [  18% ] 159/200 VUs  08.0s/45.0s

running (0m09.0s), 179/200 VUs, 85794 complete and 0 interrupted iterations
default   [  20% ] 179/200 VUs  09.0s/45.0s

running (0m10.0s), 200/200 VUs, 98118 complete and 0 interrupted iterations
default   [  22% ] 200/200 VUs  10.0s/45.0s

running (0m11.0s), 200/200 VUs, 112157 complete and 0 interrupted iterations
default   [  24% ] 200/200 VUs  11.0s/45.0s

running (0m12.0s), 200/200 VUs, 124808 complete and 0 interrupted iterations
default   [  27% ] 200/200 VUs  12.0s/45.0s

running (0m13.0s), 200/200 VUs, 137311 complete and 0 interrupted iterations
default   [  29% ] 200/200 VUs  13.0s/45.0s

running (0m14.0s), 200/200 VUs, 149145 complete and 0 interrupted iterations
default   [  31% ] 200/200 VUs  14.0s/45.0s

running (0m15.0s), 200/200 VUs, 161592 complete and 0 interrupted iterations
default   [  33% ] 200/200 VUs  15.0s/45.0s

running (0m16.0s), 200/200 VUs, 175180 complete and 0 interrupted iterations
default   [  35% ] 200/200 VUs  16.0s/45.0s

running (0m17.0s), 200/200 VUs, 189938 complete and 0 interrupted iterations
default   [  38% ] 200/200 VUs  17.0s/45.0s

running (0m18.0s), 200/200 VUs, 199759 complete and 0 interrupted iterations
default   [  40% ] 200/200 VUs  18.0s/45.0s

running (0m19.0s), 200/200 VUs, 208901 complete and 0 interrupted iterations
default   [  42% ] 200/200 VUs  19.0s/45.0s

running (0m20.0s), 200/200 VUs, 220459 complete and 0 interrupted iterations
default   [  44% ] 200/200 VUs  20.0s/45.0s

running (0m21.0s), 200/200 VUs, 233167 complete and 0 interrupted iterations
default   [  47% ] 200/200 VUs  21.0s/45.0s

running (0m22.0s), 200/200 VUs, 244991 complete and 0 interrupted iterations
default   [  49% ] 200/200 VUs  22.0s/45.0s

running (0m23.0s), 200/200 VUs, 260060 complete and 0 interrupted iterations
default   [  51% ] 200/200 VUs  23.0s/45.0s

running (0m24.0s), 200/200 VUs, 272828 complete and 0 interrupted iterations
default   [  53% ] 200/200 VUs  24.0s/45.0s

running (0m25.0s), 200/200 VUs, 283124 complete and 0 interrupted iterations
default   [  55% ] 200/200 VUs  25.0s/45.0s

running (0m26.0s), 200/200 VUs, 295982 complete and 0 interrupted iterations
default   [  58% ] 200/200 VUs  26.0s/45.0s

running (0m27.0s), 200/200 VUs, 309211 complete and 0 interrupted iterations
default   [  60% ] 200/200 VUs  27.0s/45.0s

running (0m28.0s), 200/200 VUs, 322168 complete and 0 interrupted iterations
default   [  62% ] 200/200 VUs  28.0s/45.0s

running (0m29.0s), 200/200 VUs, 332256 complete and 0 interrupted iterations
default   [  64% ] 200/200 VUs  29.0s/45.0s

running (0m30.0s), 200/200 VUs, 345289 complete and 0 interrupted iterations
default   [  67% ] 200/200 VUs  30.0s/45.0s

running (0m31.0s), 200/200 VUs, 355295 complete and 0 interrupted iterations
default   [  69% ] 200/200 VUs  31.0s/45.0s

running (0m32.0s), 200/200 VUs, 366224 complete and 0 interrupted iterations
default   [  71% ] 200/200 VUs  32.0s/45.0s

running (0m33.0s), 200/200 VUs, 378937 complete and 0 interrupted iterations
default   [  73% ] 200/200 VUs  33.0s/45.0s

running (0m34.0s), 200/200 VUs, 390242 complete and 0 interrupted iterations
default   [  75% ] 200/200 VUs  34.0s/45.0s

running (0m35.0s), 200/200 VUs, 400586 complete and 0 interrupted iterations
default   [  78% ] 200/200 VUs  35.0s/45.0s

running (0m36.0s), 200/200 VUs, 412190 complete and 0 interrupted iterations
default   [  80% ] 200/200 VUs  36.0s/45.0s

running (0m37.0s), 200/200 VUs, 423624 complete and 0 interrupted iterations
default   [  82% ] 200/200 VUs  37.0s/45.0s

running (0m38.0s), 200/200 VUs, 435426 complete and 0 interrupted iterations
default   [  84% ] 200/200 VUs  38.0s/45.0s

running (0m39.0s), 200/200 VUs, 448604 complete and 0 interrupted iterations
default   [  87% ] 200/200 VUs  39.0s/45.0s

running (0m40.0s), 200/200 VUs, 462181 complete and 0 interrupted iterations
default   [  89% ] 200/200 VUs  40.0s/45.0s

running (0m41.0s), 162/200 VUs, 475336 complete and 0 interrupted iterations
default   [  91% ] 162/200 VUs  41.0s/45.0s

running (0m42.0s), 122/200 VUs, 491367 complete and 0 interrupted iterations
default   [  93% ] 122/200 VUs  42.0s/45.0s

running (0m43.1s), 079/200 VUs, 505161 complete and 0 interrupted iterations
default   [  96% ] 079/200 VUs  43.1s/45.0s

running (0m44.0s), 042/200 VUs, 516152 complete and 0 interrupted iterations
default   [  98% ] 042/200 VUs  44.0s/45.0s

running (0m45.0s), 002/200 VUs, 524547 complete and 0 interrupted iterations
default   [ 100% ] 002/200 VUs  45.0s/45.0s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<50' p(95)=28.08ms

    http_req_failed{expected_response:true}
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 524584  11657.034691/s
    checks_succeeded...: 100.00% 524584 out of 524584
    checks_failed......: 0.00%   0 out of 524584

    ✓ status is 200 or 429

    HTTP
    http_req_duration..............: avg=13.34ms min=404µs    med=11.45ms max=309.91ms p(90)=22.23ms p(95)=28.08ms
      { expected_response:true }...: avg=13.34ms min=404µs    med=11.45ms max=309.91ms p(90)=22.23ms p(95)=28.08ms
    http_req_failed................: 0.00%  0 out of 524584
      { expected_response:true }...: 0.00%  0 out of 524584
    http_reqs......................: 524584 11657.034691/s

    EXECUTION
    iteration_duration.............: avg=14.21ms min=442.45µs med=11.87ms max=309.96ms p(90)=23.65ms p(95)=31.59ms
    iterations.....................: 524584 11657.034691/s
    vus............................: 2      min=2           max=200
    vus_max........................: 200    min=200         max=200

    NETWORK
    data_received..................: 171 MB 3.8 MB/s
    data_sent......................: 104 MB 2.3 MB/s



running (0m45.0s), 000/200 VUs, 524584 complete and 0 interrupted iterations
default ✓ [ 100% ] 000/200 VUs  45s